Repository: ippermiakov/locamath
Catalog: locamath-ios/Mathematic/Resources/Strings/*.lproj/Localizable.strings
Languages: ru

source: YES
ru: ДА

source: Coming soon
ru: Скоро

source: Calculation error
ru: Ошибка вычислений

source: and
ru: и

source: Answer
ru: Ответ

source: Name
ru: Имя

source: NO
ru: НЕТ

source: Solution
ru: Решение по действиям

source: solution
ru: по действиям

source: Task
ru: Задача

source: Save & Exit
ru: Сохранить

source: You can't delete error.
ru: Ты не можешь удалить решение, в котором допущена ошибка.

source: Message
ru: Сообщение

source: Oops! You made more than two mistakes. You can't continue solving the test problems until you finish solving the previous problems of this type
ru: Oops! Ты допустил больше двух ошибок. Ты не можешь дальше продолжать решать тестовые задачи, пока не решишь все задачи этого типа.

source: Problem
ru: Задача

source: problem
ru: задача

source: Training
ru: Обучающая

source: %@ points from %@
ru: %1$@ очков из %2$@

source: find one more way to solve this problem and earn %d points more
ru: найди еще варианты решения этой задачи и заработай еще %d очков

source: you have solved this problem with all possible solution and expression
ru: Ты нашел все возможные варианты решений

source: Expression
ru: Выражение

source: expression
ru: выражением

source: Add answer
ru: Добавить ответ

source: Answers are not identical to each other.
ru: Ответы не совпадают.

source: Change answer
ru: Изменить ответ

source: Answer field is empty
ru: Поле для ответа пустое

source: Task can have just one correct answer! Input the same ANSWER to all fields
ru: Задача может иметь только один правильный ответ! Вставь одинаковые ответы во все поля

source: Mistake put scheme message
ru: Нужно найти правильный элемент и перенести его в схему

source: Task is not solved with all possible variants.
ru: Не все возможные варианты решения задачи найдены

source: Task is solved with all possible solutions and expressions
ru: Все возможные варианты решения найдены

source: Delete
ru: Удалить

source: Add operation?
ru: Добавить действие?

source: Delete operation?
ru: Удалить действие?

source: Day
ru: День

source: Month
ru: Месяц

source: Understanding error
ru: Ошибка понимания

source: Week
ru: Неделя

source: %02i.%02i %@ (Got star)
ru: %1$i.%2$i %3$@ (Получена звезда)

source: %02i.%02i %@ (Solved)
ru: %1$i.%2$i %3$@ (Решено)

source: tap to see animation!
ru: Нажми здесь и посмотри анимацию!

source: tap to build diagram here!
ru: Составь схему!

source: drag the items here to make diagram!
ru: Перетаскивая элементы сюда, составь схему!

source: tap to solve the problem!
ru: Теперь реши задачу!

source: drag & drop the numbers here to solve the problem!
ru: Перетаскивая цифры сюда, реши задачу!

source: tap to see the mistake!
ru: Посмотри ошибку!

source: Solution1
ru: Решение

source: math expression
ru: Выражением

source: math solution
ru: По действиям

source: scheme_success_message
ru: Молодец! Схема составлена!

source: The same solutions, change one of them!
ru: Ты ввел одинаковые решения, исправь или удали одно из них!

source: Are you sure you want to exit your profile? All your data will be save and you can come back any time.
ru: Вы уверены, что хотите выйти из своего профиля? Все ваши данные сохранены, и вы можете вернуться в любое время.

source: Cancel
ru: Отмена

source: Enter your facebook account to continue
ru: Введите свой Фэйсбук аккаунт для продолжения

source: Enter your mail account to continue
ru: Введите свой email для продолжения

source: Error
ru: Ошибка

source: Structure and calculation error
ru: Ошибка в понимании и вычислениях

source: Structure error
ru: Ошибка в понимании

source: Solved
ru: Решено

source: Solved task
ru: Решена

source: Started task
ru: Начали решать

source: There are empty gaps. You should fill every gap
ru: Не все пробелы заполнены. Ты должен заполнить каждый пробел

source: Unable to perform action
ru: Невозможно выполнить действие

source: Email and Password fields are required
ru: Email и Пароль - это обязательные поля

source: Incorrect email format
ru: Неправильный формат email

source: User with same email already exists
ru: Пользователь с этим email уже существует

source: Incorrect password
ru: Неправильный пароль

source: User not found
ru: Пользователь не найден

source: User not found, you need to specify email to register
ru: Пользователь не найден, вам нужно уточнить email, чтобы зарегистрироваться

source: Name field is required
ru: Заполните поле Имя

source: Child with this name already exists
ru: Ребенок с таким именем уже существует

source: Child not found
ru: Такой пользователь не найден

source: You need to set active child
ru: Выберите ребенка

source: Permissions Denied
ru: В доступе отказано

source: Authorization Error
ru: Ошибка идентификации

source: Synchronizing. Tap to cancel
ru: Синхронизация. Нажмите для отмены

source: Synchronizing
ru: Синхронизация

source: Sending data
ru: Отправка данных

source: Getting data
ru: Получение данных

source: I solved test problem #%@ from the topic "%@"!
ru: Я решил(а) тестовую задачу №%@ в теме "%@"!

source: I solved all the test problems from the topic "%@"!
ru: Я решил(а) тестовые задачи в теме "%@"!

source: I solved olympiad problem #%@ of the first level of the "%@"!
ru: Я решил(а) олимпиадную задачу №%@ в "%@"!

source: I solved the first level of the "%@"!
ru: Я решил(а) I олимпиаду "%@"!

source: - %@ level of difficulty
ru: - %@ уровня сложности

source: - Solve %@ problems
ru: - %@ задачи для решения

source: - %@ test problems
ru: - %@ тестовых задач

source: %i. Witty olympiad problems %i levels with %@ problems in each
ru: %i. Олимпиадные задачи на смекалку: %i уровня по %@ задач

source: A total of %@ problems, %@ test problems, %@ olympiad problems
ru: Всего %@ задач, %@ тестовых задач, %@ олимпиадных задач

source: You need an internet connection in order to watch the animation
ru: Для просмотра анимации нужно подключение к интернету

source: Server Error
ru: Сервер временно не доступен. Приносим свои извинения. Мы улучшаем работу сервера. Вы можете продолжить работу офф-лайн или вернуться в приложение позже.

source: Enter your account
ru: Введите свой аккаунт

source: Enter your password
ru: Введите свой пароль

source: You should input all rows
ru: Ты должен заполнить все поля

source: Enter child name
ru: Введите имя ребенка

source: Please enter your name
ru: Введи свое имя

source: You need to confirm your e-mail before continue
ru: Вам нужно подтвердить свой e-mail

source: Failed to get location, check your network connection
ru: Не удалось определить геолокацию, проверьте подключение к интернету.

source: Dismiss
ru: Спрятать

source: Invalid nickname. You can use only Latin/Cyrillic symbols, whitespaces, digits and symbols '.-_'. Maximum is 15 symbols
ru: Некорректное имя. Вы можете использовать только кириллические-латинские символы, пробел, цифры и символы '.-_'. Максимальная длина имени 15 символов.

source: Invalid email
ru: Некорректный e-mail

source: Invalid password. Input from 6 to 15 symbols
ru: Некорректный пароль. Введите от 6 до 15 символов.

source: Censored nickname error
ru: Это имя запрещено для использования

source: Child's progress will be lost!
ru: Прогресс ребенка будет потерен

source: Explain default label
ru: Что бы зарегистрироваться нажмите «ок», чтобы продолжить использовать приложение нажмите «далее»

source: Set name for default child
ru: Введите имя ребенка

source: Explain default label4
ru: Что бы зарегистрироваться нажмите «ок», чтобы продолжить использовать приложение нажмите «отмена»!

source: Done
ru: Готово

source: Passwords don't match
ru: Пароли не совпадают

source: Password is changed
ru: Пароль изменен

source: Password was sent to your e-mail
ru: Пароль был отправлен на Вашу почту

source: Register
ru: Зарегистрироваться

source: Login
ru: Войти

source: Remove child %@ confirmation
ru: Вы хотите удалить учетную запись %@ из приложенеия LocaMath? Вся статистика будет потеряна!

source: Remove child %@ confirmation email
ru: Вам на почту выслано подтверждение об удалении. Зайдите на свою почту и подтвердите удаление учетной записи %@.

source: Continue
ru: Далее

source: Points earned
ru: Заработано очков

source: Attention
ru: Внимание

source: https://www.facebook.com/Locamath
ru: https://www.facebook.com/pages/Счастливая-Математика/407228206013293

source: fb_Locamath
ru: fb://profile/407228206013293

source: The Internet connection appears to be offline.
ru: Вероятно, соединение с Интернетом прервано.

source: No internet connection, вы не можете зарегистрироваться через FB при отсутствии интернета, зарегистрируйтесь при помощи почты
ru: При отсутствии интернета вы можете зарегистрироваться только используя свой email

source: Check facebook permissions and try again later
ru: Проверьте права доступа к вашей странице на Facebook и попробуйте еще раз

source: The version is application is lower than required/ Please update your application/
ru: Чтобы приложение работало правильно, Вам нужно обновить версию приложения!

source: Pull to refresh
ru: Потяните, чтобы обновить

source: Child not selected.
ru: Ребенок не выбран.

source: Explain default label0
ru: Без регистрации: Ребенок не сможет участвовать в рейтинге и соревноваться с другими детьми! Только один ребенок сможет пользоваться приложением! Вы не сможете получать отчеты и статистику о прогрессе вашего ребенка!

source: Explain default label1
ru: Этот раздел для нашей команды! Хочешь быть с нами в одной команде - попроси своих родителей зарегистрироваться!

source: Explain default label2
ru: Дорогие родители! Это страница отчетов и статистики. Без регистрации она бесполезна!

source: You can add just expression for this task!
ru: Эта задача может быть решена только при помощи выражения!

source: You have added all possible expressions
ru: Ты нашел все варианты решений при помощи выражений

source: You have added all possible solutions
ru: Ты нашел все варианты решений по действиям

source: Edit
ru: Редактировать
